Merging & Joining Data
Often, data is split across multiple tables or files. Pandas lets you combine them
 just like SQL â€” or even more flexibly!

In [1]:
import pandas as pd

In [2]:
employees = pd.DataFrame({
    "EmpID": [1, 2, 3],
    "Name": ["Alice", "Bob", "Charlie"],
    "DeptID": [10, 20, 30]
})

In [3]:
employees

   EmpID     Name  DeptID
0      1    Alice      10
1      2      Bob      20
2      3  Charlie      30

In [6]:
 departments = pd.DataFrame({
 "DeptID": [10, 20, 40],
 "DeptName": ["HR", "Engineering", "Marketing"]
 })

In [7]:
departments

   DeptID     DeptName
0      10           HR
1      20  Engineering
2      40    Marketing

In [9]:
pd.merge(employees, departments, on="DeptID")  #Inner join, return only matching defaults

   EmpID   Name  DeptID     DeptName
0      1  Alice      10           HR
1      2    Bob      20  Engineering

In [10]:
 pd.merge(employees, departments, on="DeptID", how="left")  
# left join all the element of employees should be there
# Keeps all employees, fills  NaN where no match

   EmpID     Name  DeptID     DeptName
0      1    Alice      10           HR
1      2      Bob      20  Engineering
2      3  Charlie      30          NaN

In [11]:
pd.merge(employees, departments, on="DeptID", how="right")    #Keeps all departments, even if no employee

   EmpID   Name  DeptID     DeptName
0    1.0  Alice      10           HR
1    2.0    Bob      20  Engineering
2    NaN    NaN      40    Marketing

Concatenating DataFrames
Use pd.concat() to stack datasets either vertically or horizontally.

In [12]:
#Vertical (rows)
df1 = pd.DataFrame({"Name": ["Alice", "Bob"]})
df2 = pd.DataFrame({"Name": ["Charlie", "David"]})

pd.concat([df1, df2])

      Name
0    Alice
1      Bob
0  Charlie
1    David

In [13]:
#Horizontal (rows)
df1 = pd.DataFrame({"ID": [1, 2]})
df2 = pd.DataFrame({"Score": [90, 80]})

pd.concat([df1, df2], axis=1)

   ID  Score
0   1     90
1   2     80